Documents/ЛБ_Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_Реализация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_РеализованныеОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОбъектыЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентами</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_НачислениеПроцентовДетально</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ПрибылиИУбыткиОтРеализации</xr:Item>
				<xr:Item>InformationRegister.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОборотыПоОперациямЗайма</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеЗалоговогоБилета</xr:Item>
				<xr:Item>InformationRegister.ЛБ_СостояниеОбъектаЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_РасчетыСКлиентамиБУ</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйПользователь</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеНомера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРеализация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗалоговыйБилет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЗалога</Name>
							<Comment>Объект залога</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеСкидки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяЦена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОценки</Name>
							<Comment>Сумма оценки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЛБ_РеализованныеОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РеализованныеОбъектыЗалога</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеализации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_НачислениеПроцентовДетально.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_НачислениеПроцентовДетально</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПроцентнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыПроцентныхСтавок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНач</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньКон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентнаяСтавкаБазовая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентнаяСтавкаАкция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеАкцияОтностельное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтклонениеАкцияАбсолютное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиБУ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЛБ_Реализация/Ext/ObjectModule.bsl
Перем КассоваяСмена;
перем МоментДоДокумента;
		
Функция ПолучитьРеализованныеОЗ() 
	СписокЗБ = Новый СписокЗначений;
	Для каждого стр Из ЭтотОбъект.Товары Цикл  
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда	
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
	    КонецЕсли;	
    КонецЦикла;
	
	Запрос = Новый Запрос;        
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация); 
	Запрос.УстановитьПараметр("ЗБ", СписокЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РеализованныеОбъектыЗалогаОбороты.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеализованныеОбъектыЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РеализованныеОбъектыЗалога.Обороты(
	               |			,
	               |			&Дата,
	               |			,
	               |			Организация = &Организация
	               |				И ЗалоговыйБилет В (&ЗБ)) КАК ЛБ_РеализованныеОбъектыЗалогаОбороты"; 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого стр Из ЭтотОбъект.Товары Цикл
		НоваяСтр = ТаблицаЗапроса.Добавить(); 
		НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
	КонецЦикла;	
	Возврат ТаблицаЗапроса;
КонецФункции			  
			  
Функция ПроверитьЗБРеализован(ТаблицаТоваров, ЗалоговыйБилет)
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", ЗалоговыйБилет);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалога.ОбъектЗалога КАК ОбъектЗалога
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога КАК ЛБ_ОбъектыЗалога
	               |ГДЕ
	               |	ЛБ_ОбъектыЗалога.Регистратор = &Регистратор";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого стрЗ Из ТаблицаЗапроса Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", ЗалоговыйБилет); 
		Отбор.Вставить("ОбъектЗалога", СтрЗ.ОбъектЗалога);
		СтрокиЗ = ТаблицаТоваров.НайтиСтроки(Отбор);
		Если строкиЗ.Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Истина;
КонецФункции

Функция СоздатьНовуюОплатуПроцентов(ЗалоговыйБилет)
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОплатаПроцентов; 
	Если ЭтотОбъект.Проведен Тогда
	    ДокументОбъект.Дата = Дата-1; 
	Иначе	  
		ДокументОбъект.Дата = Дата;  
	КонецЕсли;	
	ДокументОбъект.Организация = Организация;
	ДокументОбъект.ПроцентнаяСхема = ЗалоговыйБилет.ПроцентнаяСхема;  
	ДокументОбъект.Выкуп = Ложь;
	Возврат ДокументОбъект; 
КонецФункции

Функция РасчетыПоЗалоговомуБилету(ЗалоговыйБилет, СуммаЗайма, ДатаНачалаРасчета, ПричинаПримененияПроцентнойСхемы, СуммаПродажи, Реализован) 
	СуммаОплатить = СуммаПродажи;    	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СуммаЗайма", СуммаЗайма);  
	СтруктураВозврата.Вставить("ОстатокПроцентов", 0);
	СтруктураВозврата.Вставить("НачисленоПроцентов", 0);
	СтруктураВозврата.Вставить("ОплатаПроцентов", 0);
	СтруктураВозврата.Вставить("ОплатаЗайма", 0); 
	СтруктураВозврата.Вставить("ВыбытиеПроцентов", 0);
	СтруктураВозврата.Вставить("ВыбытиеЗайма", 0);
	
	ДокументОплаты = СоздатьНовуюОплатуПроцентов(ЗалоговыйБилет); 
	Если ЛБ_УправлениеЛомбардом.ПроверкаНеНачислятьПроцентыПриРеализации(Дата, ЗалоговыйБилет) Тогда  	   
		СуммаПроцентовВсего = ЛБ_Общиймодуль.ПолучитьОстатокПроцентов(ДокументОплаты, ЗалоговыйБилет);
		СтруктураВозврата.НачисленоПроцентов = СуммаПроцентовВсего;
		СуммаПроцентовНачислено = 0;
	Иначе	
		СтруктураП = ЛБ_УправлениеЛомбардом.ПолучитьПредельныеЗначенияПроцентов(ЗалоговыйБилет.Дата, ЗалоговыйБилет.Организация);
		Если НЕ СтруктураП = неопределено Тогда
		    ПланкаПроцентов = СтруктураП.ПланкаПроцентов;
			ПредельноеЗначениеПроцентов = ЗалоговыйБилет.СуммаСсуды*СтруктураП.ПланкаПроцентов; 
		Иначе
			ПредельноеЗначениеПроцентов = 0;
		КонецЕсли;   
		СтруктураОкр = ЛБ_УправлениеЛомбардом.ПолучитьУсловияОкругленияПроцентов(ЗалоговыйБилет);
		Установки = ЛБ_УправлениеЛомбардом.ПолучитьУсловияПоДоговору(ЗалоговыйБилет); 	
		Результат = ЛБ_ОбщийМодуль.РассчитатьСуммуПроцентовОплата(ДокументОплаты, ДатаНачалаРасчета, ПредельноеЗначениеПроцентов, ПричинаПримененияПроцентнойСхемы, Установки, СтруктураОкр);
		СуммаПроцентовНачислено = ДокументОплаты.НачислениеПроцентовДетально.Итог("СуммаПроцентов");
		СуммаПроцентовВсего = Результат.СуммаПроцентов; 
		СтруктураВозврата.НачисленоПроцентов = СуммаПроцентовВсего;  
	КонецЕсли;	
	
	Если СуммаПроцентовВсего < СуммаОплатить Тогда
	    СуммаОплатыПроценты = СуммаПроцентовВсего;
		СуммаОплатить = СуммаОплатить - СуммаОплатыПроценты;
	Иначе 
		СуммаОплатыПроценты = СуммаОплатить;
		СуммаОплатить = 0;
	КонецЕсли;	   
	СтруктураВозврата.ОплатаПроцентов = СуммаОплатыПроценты; 
	СтруктураВозврата.ОстатокПроцентов = СуммаПроцентовВсего - СуммаОплатыПроценты;
		
	Для каждого Стр из ДокументОплаты.НачислениеПроцентовДетально Цикл	
		Движение = Движения.ЛБ_НачислениеПроцентовДетально.Добавить();
		Движение.Период = Дата;     
		Движение.ЗалоговыйБилет = ЗалоговыйБилет; 
		Движение.ДатаНачалаРасчета = ДатаНачалаРасчета;
        Движение.ВидПроцентнойСтавки = стр.ВидПроцентнойСтавки;
		Движение.ДатаНач = стр.ДатаНач;
		Движение.ДатаКон = стр.ДатаКон;
		Движение.ДеньНач = Стр.ДеньНач;
		Движение.ДеньКон = Стр.ДеньКон;
		Движение.СуммаПроцентов = Стр.СуммаПроцентов;
		Движение.СуммаПроцентовДень = Стр.СуммаПроцентовДень;
		Движение.ПроцентнаяСтавкаБазовая = Стр.ПроцентнаяСтавкаБазовая;
		Движение.ПроцентнаяСтавкаАкция = Стр.ПроцентнаяСтавкаАкция;
		Движение.ОтклонениеАкцияАбсолютное = Стр.ОтклонениеАкцияАбсолютное;
		Движение.ОтклонениеАкцияОтностельное = Стр.ОтклонениеАкцияОтносительное;
	КонецЦикла;				
	
	СуммаНачисленоБУ = 0;
	
	ЗапросРасчеты = Новый Запрос;  
	ЗапросРасчеты.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);
	ЗапросРасчеты.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
	ЗапросРасчеты.УстановитьПараметр("ДатаНачалаРасчета", ДатаНачалаРасчета); 
	ЗапросРасчеты.УстановитьПараметр("Дата", Этотобъект.Дата); 
	ЗапросРасчеты.Текст = "ВЫБРАТЬ
	                      |	ЛБ_РасчетыСКлиентамиБУ.Регистратор КАК Регистратор,
	                      |	ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет КАК ЗалоговыйБилет,
	                      |	ЛБ_РасчетыСКлиентамиБУ.Сумма КАК Сумма
	                      |ИЗ
	                      |	РегистрНакопления.ЛБ_РасчетыСКлиентамиБУ КАК ЛБ_РасчетыСКлиентамиБУ
	                      |ГДЕ
	                      |	ЛБ_РасчетыСКлиентамиБУ.ВидРасчета = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыРасчетов.ПоПроцентам)
	                      |	И ЛБ_РасчетыСКлиентамиБУ.ЗалоговыйБилет = &ЗалоговыйБилет
	                      |	И ЛБ_РасчетыСКлиентамиБУ.Организация = &Организация
	                      |	И ЛБ_РасчетыСКлиентамиБУ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |	И ЛБ_РасчетыСКлиентамиБУ.ДатаНачалаРасчета = &ДатаНачалаРасчета
	                      |	И ЛБ_РасчетыСКлиентамиБУ.Период < &Дата
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЛБ_РасчетыСКлиентамиБУ.Период УБЫВ";
	ВыборкаБУ = ЗапросРасчеты.Выполнить().Выбрать(); 
	СуммаОтмены = 0;
	Пока ВыборкаБУ.Следующий() Цикл 
		Если НЕ ТипЗнч(ВыборкаБУ.Регистратор) = Тип("ДокументСсылка.ЛБ_РегламентноеНачислениеПроцентов") Тогда
			Если ВыборкаБУ.Сумма < 0 Тогда //отмена 
				СуммаОтмены = ВыборкаБУ.Сумма;
				Продолжить;
			ИначеЕсли (ВыборкаБУ.Сумма + СуммаОтмены) = 0 Тогда 
				СуммаОтмены = 0;
				Продолжить;
			Иначе	
			    Прервать;
			КонецЕсли;	  
		КонецЕсли;	
		СуммаНачисленоБУ = СуммаНачисленоБУ + ВыборкаБУ.Сумма;
	КонецЦикла;	 
    СуммаПроцентовНачисленоБУ = СуммаПроцентовНачислено - СуммаНачисленоБУ;
	Если НЕ СуммаПроцентовНачисленоБУ = 0 Тогда 
		Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
		Движение.Период = Дата;     
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Организация = ЗалоговыйБилет.Организация; 
		Движение.Ломбард = ЗалоговыйБилет.Ломбард;
		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
		Движение.Клиент = ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;				
		Движение.ДатаНачалаРасчета = ДатаНачалаРасчета;		
		Движение.Сумма = СуммаПроцентовНачисленоБУ;     
	КонецЕсли;	


	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет);	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	               |	СУММА(ЛБ_РасчетыСКлиентамиОстатки.СуммаОстаток) КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентами.Остатки(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ВидРасчета = &ВидРасчета) КАК ЛБ_РасчетыСКлиентамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиОстатки.ДатаНачалаРасчета";
	
	Если НЕ СуммаОплатыПроценты = 0 Тогда
		Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам);
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		СуммаОплатитьПроценты = СуммаОплатыПроценты;
		Для каждого Стр Из ТаблицаОстатков Цикл
			Если стр.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если СуммаОплатитьПроценты = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Если Стр.Сумма < СуммаОплатитьПроценты Тогда
			    Движение.Сумма = Стр.Сумма;
				СуммаОплатитьПроценты = СуммаОплатитьПроценты - Стр.Сумма;
			Иначе
				Движение.Сумма = СуммаОплатитьПроценты;
				СуммаОплатитьПроценты = 0;
			КонецЕсли; 
			Движение.Комментарий = "Оплачены проценты за период с " + Формат(Стр.ДатаНачалаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаНачалаРасчета, "ДФ=dd.MM.yyyy"); 
		КонецЦикла;	
		
		Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
		Движение.Период = Дата;     
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Организация = Организация; 
		Движение.Ломбард = ЗалоговыйБилет.Ломбард;
		Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
		Движение.Клиент = ЗалоговыйБилет.Залогодатель;
		Движение.ЗалоговыйБилет = ЗалоговыйБилет;				
		Движение.ДатаНачалаРасчета = ДатаНачалаРасчета;		
		Движение.Сумма = СуммаОплатыПроценты;      
		
		ОтборЗБ = Новый Структура;
		ОтборЗБ.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);
		СтрокиЗБ = ЭтотОбъект.Товары.НайтиСтроки(ОтборЗБ);  
		Для каждого СтрЗБ Из СтрокиЗБ Цикл
			Движение = Движения.ЛБ_РасчетыСКлиентамиБУ.Добавить();
			Движение.Период = Дата;     
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Организация = Организация; 
			Движение.Ломбард = ЗалоговыйБилет.Ломбард;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = СтрЗБ.ЗалоговыйБилет;	
			Движение.ОбъектЗалога = СтрЗБ.ОбъектЗалога;	
			Движение.Сумма = СтрЗБ.СуммаОценки;
		КонецЦикла;	

		
        КоличествоДнейРасчета = ?(НачалоДня(ДатаНачалаРасчета) = НачалоДня(Дата), 0, (НачалоДня(Дата) - НачалоДня(ДатаНачалаРасчета)) / (60 * 60 * 24)) + 1; 
		Если НЕ СуммаПроцентовНачислено = 0 Тогда 							
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчета;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сумма = СуммаПроцентовНачислено; 
			Движение.Комментарий = "Начисленены проценты за период с " + Формат(ДатаНачалаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy"); 
			Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
        КонецЕсли;

		Если НЕ СуммаОплатитьПроценты = 0 Тогда 
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = ДатаНачалаРасчета;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоПроцентам;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сумма = СуммаОплатитьПроценты; 
			Движение.Комментарий = "Оплачены проценты за период с " + Формат(ДатаНачалаРасчета, "ДФ=dd.MM.yyyy") + " по " + Формат(Дата, "ДФ=dd.MM.yyyy");
			Движение.КоличествоДнейРасчета = КоличествоДнейРасчета;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ СуммаОплатить = 0 Тогда			
		Запрос.УстановитьПараметр("ВидРасчета", Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу);
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		СуммаОплатитьОсновнойДолг = СуммаОплатить; 
		ОплатаЗайма = 0;
		Для каждого Стр Из ТаблицаОстатков Цикл
			Если стр.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если СуммаОплатитьОсновнойДолг = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Движение = Движения.ЛБ_РасчетыСКлиентами.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДатаНачалаРасчета = Стр.ДатаНачалаРасчета;
			Движение.ВидРасчета = Перечисления.ЛБ_ВидыРасчетов.ПоОсновномуДолгу;
			Движение.Клиент = ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = ЗалоговыйБилет;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Если Стр.Сумма < СуммаОплатитьОсновнойДолг Тогда
			    Движение.Сумма = Стр.Сумма;
				СуммаОплатитьОсновнойДолг = СуммаОплатитьОсновнойДолг - Стр.Сумма;
			Иначе
				Движение.Сумма = СуммаОплатитьОсновнойДолг;
				СуммаОплатитьОсновнойДолг = 0;
			КонецЕсли; 
			ОплатаЗайма = ОплатаЗайма + Движение.Сумма;
		КонецЦикла;	   
				
		СтруктураВозврата.ОплатаЗайма = ОплатаЗайма; 
		СтруктураВозврата.СуммаЗайма = СуммаЗайма - ОплатаЗайма; 
	КонецЕсли;  
	СтруктураВозврата.ВыбытиеПроцентов = СтруктураВозврата.НачисленоПроцентов;  
	Если Реализован Тогда 
		СтруктураВозврата.ВыбытиеЗайма = СуммаЗайма;
	Иначе	
	    СтруктураВозврата.ВыбытиеЗайма = ОплатаЗайма;
	КонецЕсли;	
		
	Возврат СтруктураВозврата;
КонецФункции	

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
		Если ЭтотОбъект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет Тогда   
			Результат = ЛБ_ОбщийМодуль.ПолучитьОткрытуюКассовуюСмену(Дата, Организация, Ломбард); 
			Если НЕ Результат = неопределено Тогда 
			    КассоваяСмена = Результат.КассоваяСмена;
			Иначе       
				Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда  
					ОбщегоНазначения.СообщитьПользователю("На дату документа не открыта кассовая смена в ломбарде!");
				    Отказ = Истина;   
				КонецЕсли;	
			КонецЕсли;	  
		КонецЕсли;
		Если НЕ Отказ Тогда 
			Для каждого Стр Из ЭтотОбъект.Товары Цикл		
			    НаборЗаписей = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьНаборЗаписей();
			    НаборЗаписей.Отбор.ЗалоговыйБилет.Установить(Стр.ЗалоговыйБилет); 
				НаборЗаписей.Отбор.ОбъектЗалога.Установить(Стр.ОбъектЗалога);
			    НаборЗаписей.Записать(); 
			КонецЦикла;	          
		КонецЕсли;	  
	КонецЕсли;	
	Если ЭтотОбъект.ПометкаУдаления Тогда  
		Для каждого Стр Из ЭтотОбъект.Товары Цикл		
		    НаборЗаписей = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьНаборЗаписей();
		    НаборЗаписей.Отбор.ЗалоговыйБилет.Установить(Стр.ЗалоговыйБилет); 
			НаборЗаписей.Отбор.ОбъектЗалога.Установить(Стр.ОбъектЗалога);
		    НаборЗаписей.Записать(); 
		КонецЦикла;	      
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись Тогда  
		Для каждого Стр Из Товары Цикл
		    Запись = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьМенеджерЗаписи();
			Запись.ОбъектЗалога = Стр.ОбъектЗалога;
			Запись.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Запись.Прочитать();
			Если НЕ Запись.Выбран() Тогда 
				Запись.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Запись.ОбъектЗалога = Стр.ОбъектЗалога;
				Запись.ДокументРеализации = Ссылка;
			    Запись.Ответственный = ОтветственныйСотрудник;
				Запись.Записать();   
			КонецЕсли;	
	    Конеццикла;	  
	КонецЕсли;	
КонецПроцедуры
	
// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	Движения.ЛБ_ОборотыПоОперациямЗайма.Записывать = Истина;
	Движения.ЛБ_ОбъектыЗалога.Записывать = Истина;    
	Движения.ЛБ_СостояниеОбъектаЗалога.Записывать = Истина; 
	Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Записывать = Истина; 
	Движения.ЛБ_СостояниеЗалоговогоБилета.Записывать = Истина;
	Движения.ЛБ_РеализованныеОбъектыЗалога.Записывать = Истина;
	Движения.ЛБ_ПрибылиИУбыткиОтРеализации.Записывать = Истина;  
	Движения.ЛБ_НачислениеПроцентовДетально.Записывать = Истина; 
	Движения.ЛБ_РасчетыСКлиентамиБУ.Записывать = Истина;  
	Движения.ЛБ_РасчетыСКлиентами.Записывать = Истина; 
	Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Записывать = Истина;
	
	ОбменДаннымиСервер.УдалитьДвиженияУДокумента(ЭтотОбъект);

	
	ТаблицаТоваров = ЭтотОбъект.Товары.Выгрузить();
	Для каждого Стр Из ЭтотОбъект.Товары Цикл  
		Движение = Движения.ЛБ_РеализованныеОбъектыЗалога.Добавить();
		Движение.Организация = Организация;
		Движение.Период = Дата; 
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.Количество = Стр.Количество;
		Движение.СуммаОценки = Стр.СуммаОценки; 
		Движение.СуммаРеализации = Стр.ФактическаяЦена;  
		
		Движение = Движения.ЛБ_ОбъектыЗалога.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;  
		Движение.Склад = Склад;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.Количество = Стр.Количество;
		Движение.СуммаОценки = Стр.СуммаОценки;  
		//Савранин
		//Движение.СуммаОценкиНачальная = Стр.СуммаОценки; 
			
		Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
		Движение.Период = Дата;
		Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
		Движение.ОбъектЗалога = Стр.ОбъектЗалога;
		Движение.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Реализован;
		СтруктураСостояниеОЗ = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектовЗалогаЗалоговогоБилета(Дата-1, Стр.ЗалоговыйБилет, Стр.ОбъектЗалога);
		Если НЕ СтруктураСостояниеОЗ = неопределено Тогда  
			Движение.СуммаЗайма = СтруктураСостояниеОЗ.СуммаДолгаЗайма;
			Движение.СуммаОценки = СтруктураСостояниеОЗ.СуммаОценки;
			Движение.СуммаДолгаЗайма = 0;
			Движение.СуммаОплаты = СтруктураСостояниеОЗ.СуммаДолгаЗайма;   
			Движение.СуммаОценкиНачальная = СтруктураСостояниеОЗ.СуммаОценкиНач;
			
			ДвижениеР = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить(); 
			ДвижениеР.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеР.Период = Дата;
			ДвижениеР.Клиент = Стр.ЗалоговыйБилет.Залогодатель;
			ДвижениеР.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			ДвижениеР.ОбъектЗалога = Стр.ОбъектЗалога;
			ДвижениеР.Сумма = СтруктураСостояниеОЗ.СуммаЗайма; 		
		КонецЕсли;		              
		Движение.Комментарий = "Дата реализации " + Формат(Дата, "ДФ=dd.MM.yyyy") + ", подразделение реализации " + СокрЛП(ЭтотОбъект.Ломбард) + ", склад реализации " + СокрЛП(ЭтотОбъект.Склад) +
		     "%" + ?(ЗначениеЗаполнено(Контрагент), ", контрагент " + СокрЛП(ЭтотОбъект.Контрагент), "") + ", сумма реализации " + сокрЛП(Формат(стр.ФактическаяЦена, "ЧЦ=15; ЧДЦ=2"));
	КонецЦикла;	 

	ТаблицаЗБ = ЭтотОбъект.Товары.Выгрузить(); 
	ТаблицаЗБ.Свернуть("ЗалоговыйБилет", "ФактическаяЦена");  
	
	ТаблицаТоваров = ПолучитьРеализованныеОЗ();
	
	Для каждого Стр Из ТаблицаЗБ Цикл
	    		
		Реализован = ПроверитьЗБРеализован(ТаблицаТоваров, Стр.ЗалоговыйБилет); 
		
		Запрос = новый Запрос;
		Запрос.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
		Запрос.УстановитьПараметр("Период", Дата-1);  		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Регистратор КАК Регистратор,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупа КАК ДатаВыкупа,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовДень КАК СуммаПроцентовДень,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СуммаПроцентовСрок КАК СуммаПроцентовСрок,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗайма КАК ПредельныйСрокЗайма,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПредельныйСрокЗаймаДни КАК ПредельныйСрокЗаймаДни,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.НомерДопСоглашения КАК НомерДопСоглашения,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ПричинаПрименения КАК ПричинаПрименения,
		               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СхемаКредитования КАК СхемаКредитования
		               |ИЗ
		               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Период, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать(); 
		ТаблицаРеализованныхОЗ = Движения.ЛБ_СостояниеОбъектаЗалога.Выгрузить();
		Если Выборка.Следующий() Тогда 
		   
			Статус = Выборка.СтатусЗалоговогоБилета; 
			СуммаЗайма = Выборка.СуммаЗайма;         
			ДатаНачалаРасчета = Выборка.ДатаНачалаРасчетаПроцентов; 
			ПричинаПримененияПроцентнойСхемы = Выборка.ПричинаПрименения;

		    СтруктураВ = РасчетыПоЗалоговомуБилету(Стр.ЗалоговыйБилет, СуммаЗайма, ДатаНачалаРасчета, ПричинаПримененияПроцентнойСхемы, Стр.ФактическаяЦена, Реализован);
		
			Движение = Движения.ЛБ_СостояниеЗалоговогоБилета.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
			Движение.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;    
			Если Реализован Тогда
			    Движение.СтатусЗалоговогоБилета = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Реализован;
				Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;
				Движение.ПричинаПрименения = Выборка.ПричинаПрименения;  
				Движение.СхемаКредитования = Выборка.СхемаКредитования;
			Иначе  
				Движение.СтатусЗалоговогоБилета = Выборка.СтатусЗалоговогоБилета; 
				Движение.НомерДопСоглашения = Выборка.НомерДопСоглашения;
				Движение.ДатаНачалаРасчетаПроцентов = Выборка.ДатаНачалаРасчетаПроцентов;
				Движение.СуммаЗайма = СуммаЗайма - СтруктураВ.ОплатаЗайма;
				Движение.ПричинаПрименения = Выборка.ПричинаПрименения;  
				Движение.ДатаВыкупа = Выборка.ДатаВыкупа;
				Движение.ДатаВыкупаЛьготныйСрок = Выборка.ДатаВыкупаЛьготныйСрок;
				Движение.СхемаКредитования = Выборка.СхемаКредитования;
			КонецЕсли;	 
			
			СуммаРеализованныхОЗ = 0;
			ОтборЗ = Новый Структура;
			ОтборЗ.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
			СтрокиЗ = ТаблицаРеализованныхОЗ.НайтиСтроки(ОтборЗ);  
			Для каждого СтрЗ Из СтрокиЗ Цикл 
				СуммаРеализованныхОЗ = СуммаРеализованныхОЗ + СтрЗ.СуммаОплаты;
			Конеццикла;	
			СуммаДляРаспределения = СтруктураВ.ОплатаЗайма - СуммаРеализованныхОЗ;   
			Если НЕ СуммаДляРаспределения = 0 Тогда
				ЗапросОЗ = Новый Запрос;                                               
				ЗапросОЗ.УстановитьПараметр("Дата", Дата);
				ЗапросОЗ.УстановитьПараметр("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
				ЗапросОЗ.Текст = "ВЫБРАТЬ
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценкиНачальная КАК СуммаОценкиНачальная,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОценки КАК СуммаОценки,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаЗайма КАК СуммаЗайма,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаОплаты КАК СуммаОплаты,
				                 |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СуммаДолгаЗайма КАК СуммаДолгаЗайма
				                 |ИЗ
				                 |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
				                 |ГДЕ
				                 |	НЕ ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалога.Реализован)";    
				ТаблицаОЗ = ЗапросОЗ.Выполнить().Выгрузить();
				УдСтроки = новый СписокЗначений;
				Для каждого ВыборкаОЗ Из ТаблицаОЗ цикл  
					Отбор = Новый Структура;
					Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
					Отбор.Вставить("ОбъектЗалога", ВыборкаОЗ.ОбъектЗалога);
					СтрокиОЗ = Товары.НайтиСтроки(Отбор);
					Если НЕ строкиОЗ.Количество() = 0 Тогда
						УдСтроки.Добавить(ВыборкаОЗ);
					Конецесли;
				Конеццикла;	 
				Для каждого Эл Из Удстроки Цикл
					ТаблицаОЗ.Удалить(Эл.Значение);
				Конеццикла;	                       
				
				Если НЕ ТаблицаОЗ.Количество() = 0  Тогда
					МаксОценкаОЗ = 0;  
					ИтогСуммаОценки = ТаблицаОЗ.Итог("СуммаОценки");
					Для каждого СтрОЗ из ТаблицаОЗ Цикл 
						Коэф = СтрОЗ.СуммаОценки/ИтогСуммаОценки;   
						СтрОЗ.СуммаЗайма = СтрОЗ.СуммаДолгаЗайма;
						СтрОЗ.СуммаДолгаЗайма = СтруктураВ.СуммаЗайма*Коэф;  
						МаксОценкаОЗ = ?(МаксОценкаОЗ < СтрОЗ.СуммаОценки, СтрОЗ.СуммаОценки, МаксОценкаОЗ); 
					КонецЦикла;
					Если НЕ (СтруктураВ.СуммаЗайма = ТаблицаОЗ.Итог("СуммаДолгаЗайма")) Тогда 
						ОтборОЗ = Новый Структура;
						ОтборОЗ.Вставить("СуммаОценки", МаксОценкаОЗ); 
						СтрокиОЗ = ТаблицаОЗ.НайтиСтроки(ОтборОЗ);
						Если НЕ строкиОЗ.Количество() = 0 Тогда 
							СтрОЗ = СтрокиОЗ.Получить(0);
							СтрОЗ.СуммаДолгаЗайма = СтрОЗ.СуммаДолгаЗайма + (СтруктураВ.СуммаЗайма - ТаблицаОЗ.Итог("СуммаДолгаЗайма"));
						КонецЕсли;	 
					КонецЕсли;	    
					Для каждого СтрОЗ из ТаблицаОЗ Цикл 
						Движение = Движения.ЛБ_СостояниеОбъектаЗалога.Добавить();
						Движение.Период = Дата;
						Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
						Движение.ОбъектЗалога = СтрОЗ.ОбъектЗалога;
						Движение.СтатусОбъектаЗалога = СтрОЗ.СтатусОбъектаЗалога; 
						Движение.СуммаОценкиНачальная = СтрОЗ.СуммаОценкиНачальная;						
						Движение.СуммаОценки = СтрОЗ.СуммаОценки; 
						Разница = СтрОЗ.СуммаЗайма - СтрОЗ.СуммаДолгаЗайма;
						Если Разница > 0 Тогда
						     Движение.СуммаОплаты = Разница;
							 Движение.СуммаЗайма = СтрОЗ.СуммаЗайма;
						 Иначе  
							 Движение.СуммаОплаты = 0; 
							 Движение.СуммаЗайма = СтрОЗ.СуммаДолгаЗайма;
						КонецЕсли;	
						Движение.СуммаДолгаЗайма = СтрОЗ.СуммаДолгаЗайма; 
						  
						ДвижениеР = Движения.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Добавить(); 
						ДвижениеР.ВидДвижения = ВидДвиженияНакопления.Расход;
						ДвижениеР.Период = Дата;
						ДвижениеР.Клиент = Стр.ЗалоговыйБилет.Залогодатель;
						ДвижениеР.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
						ДвижениеР.ОбъектЗалога = СтрОЗ.ОбъектЗалога;
						ДвижениеР.Сумма = Разница; 	
					КонецЦикла;	
				КонецЕсли;	
			КонецЕсли;	
			
			
			НомОЗ = 0;  
			ОтборОЗ = Новый Структура;
			ОтборОЗ.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет); 
			СтрокиОЗ = Товары.НайтиСтроки(ОтборОЗ);
			
			Для каждого СтрОЗ из СтрокиОЗ Цикл
				Движение = Движения.ЛБ_ПрибылиИУбыткиОтРеализации.Добавить();
				Движение.Период = Дата;
				Движение.ДокументРеализации = Ссылка;
				Движение.Организация = Организация;
				Движение.Ломбард = Стр.ЗалоговыйБилет.Ломбард;
				Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
				Движение.ОбъектЗалога = СтрОЗ.ОбъектЗалога;
				Движение.СуммаРеализации = СтрОЗ.ФактическаяЦена;
				Движение.ДатаРеализации = НачалоДня(Дата);
				Движение.Контрагент = Контрагент;
				Если НомОЗ = 0 Тогда
					Движение.НачисленоПроценты = СтруктураВ.НачисленоПроцентов; 
					Движение.ВыбытиеПроценты = СтруктураВ.ВыбытиеПроцентов;
	                Движение.ВыбытиеОсновнойДолг = СтруктураВ.ВыбытиеЗайма;
					Движение.ОплаченоОсновнойДолг = СтруктураВ.ОплатаЗайма;
					Движение.ОплаченоПроценты = СтруктураВ.ОплатаПроцентов;
					Движение.ОстатокОсновнойДолгНачальный = СуммаЗайма;
					Движение.ОстатокОсновнойДолг = СтруктураВ.СуммаЗайма;
					Движение.ОстатокПроценты  = СтруктураВ.НачисленоПроцентов - СтруктураВ.ОплатаПроцентов; 
					Если Реализован ИЛИ СтруктураВ.СуммаЗайма = 0 Тогда
					    Движение.СуммаПрибылиУбытка = Стр.ФактическаяЦена - (СуммаЗайма + СтруктураВ.НачисленоПроцентов);
					КонецЕсли; 
				КонецЕсли; 
				НомОЗ = НомОЗ + 1;
			КонецЦикла;	
			  
			
			Движение = Движения.ЛБ_ОборотыПоОперациямЗайма.Добавить();
			Движение.Период = Дата; 
			Движение.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель;
			Движение.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
			Движение.Организация = ЭтотОбъект.Организация;
			Движение.Ломбард = ЭтотОбъект.Ломбард;  
			Движение.ВидОперации = "Реализация невостребованных залогов";  
			Движение.СуммаОплатыЗайм = СтруктураВ.ОплатаЗайма;
			Движение.СуммаОплатыПроценты = СтруктураВ.ОплатаПроцентов;

		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не определено состояниз ЗБ № " + Стр.ЗалоговыйБилет.НомерЗалоговогоБилета);
		КонецЕсли;	
	КонецЦикла;
	
	Движение = Движения.ЛБ_ОперацииДвиженияОбъектовЗалогаПоСкладам.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;  
	Движение.ПодразделениеОсновное = ЭтотОбъект.Ломбард;
	Движение.СкладОсновной = ЭтотОбъект.Склад;
	Движение.ПодразделениеОтправитель = ЭтотОбъект.Ломбард;
	Движение.СкладОтправитель = ЭтотОбъект.Склад;   
	Движение.Количество = Товары.Итог("Количество");
	Движение.Ответственный = ЭтотОбъект.ОтветственныйСотрудник; 
	Движение.ВидОперации = "Реализация залогов"; 
	Движение.НомерЗБ = ЭтотОбъект.ПредставлениеНомера;
	Движение.СуммаПродажи = ЭтотОбъект.СуммаПродажи;
	Движение.Контрагент = ЭтотОбъект.Контрагент;
	
	Если ЭтотОбъект.СпособОплаты = Перечисления.ЛБ_СпособыОплаты.НаличныйРасчет Тогда   
		Движения.ЛБ_ДенежныеСредства.Записывать = Истина;
		Движение = Движения.ЛБ_ДенежныеСредства.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Ломбард = Ломбард;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;	
		Движение.Сумма = ЭтотОбъект.СуммаПродажи;
		
		Движения.ЛБ_ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ЛБ_ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.Организация = ЭтотОбъект.Организация;
		Движение.Ломбард = ЭтотОбъект.Ломбард;
		Движение.ВидДенежныхСредств = Перечисления.ЛБ_ВидыДенежныхСредств.Наличные;
		Движение.ВидДвиженияДС = Перечисления.ЛБ_ВидыДвиженияДС.Приход;		
		Движение.Сумма = ЭтотОбъект.СуммаПродажи;                                 
		Движение.Контрагент = ЭтотОбъект.Контрагент; 
		Движение.Основание = "Реализация невостребованных залогов";
        Движение.ВидОперации = Перечисления.ЛБ_ВидыОперацийПКО.ПоступленияОтПокупателейНевостребованныхЗалогов; 
		Движение.КассоваяСмена = КассоваяСмена;
		Если ЗначениеЗаполнено(КассоваяСмена) Тогда 
			ПКО = ЛБ_УправлениеЛомбардом.СоздатьПКО(Ссылка, КассоваяСмена);				
			Движение.КассоваяОперация = ПКО;  
			Движение.Номер = ПКО.ПредставлениеНомераПКО;   
		Иначе
			ПКО = ЛБ_УправлениеЛомбардом.ПолучитьПКОРеализации(Ссылка);
			Если НЕ ПКО = неопределено Тогда  
				Движение.КассоваяОперация = ПКО;  
			    Движение.Номер = ПКО.ПредставлениеНомераПКО;   
			КонецЕсли;	
		КонецЕсли;	
		Движение.ДополнительнаяИнформация = "Реализация невостребованных залогов № " + СокрЛП(ЭтотОбъект.НомерРеализации) + " от " + Формат(ЭтотОбъект.Дата, "ДФ=dd.MM.yyyy");
		Результат = ЛБ_ОбщийМодуль.ЗаполнитьДтКт(Движение.ВидОперации);
	    Движение.Дт = Результат.Дт;
	    Движение.Кт = Результат.Кт;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда  
		Если НЕ УправлениеДоступом.ЕстьРоль("ЛБ_Суперпользователь") Тогда 
            ОбщегоНазначения.СообщитьПользователю("Вам запрещена отмена проведения этого документа!");
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	Если НЕ Отказ И НЕ ЭтотОбъект.ПометкаУдаления Тогда
		Для каждого Стр Из Товары Цикл
		    Запись = РегистрыСведений.ЛБ_ОбъектыЗалогаДобавленныеВРеализацию.СоздатьМенеджерЗаписи();
			Запись.ОбъектЗалога = Стр.ОбъектЗалога;
			Запись.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			Запись.Прочитать();
			Если НЕ Запись.Выбран() Тогда 
				Запись.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
				Запись.ОбъектЗалога = Стр.ОбъектЗалога;
				Запись.ДокументРеализации = Ссылка;
			    Запись.Ответственный = ОтветственныйСотрудник;
				Запись.Записать();   
			КонецЕсли;	
	    Конеццикла;	  
	КонецЕсли;	
КонецПроцедуры // ОбработкаУдаленияПроведения()  

МоментДоДокумента = Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая);
